src/cfe/КСП/InformationRegisters/ксп_СоответствиеДокументовПланПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_СоответствиеДокументовПланПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерДокументаЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГУИДЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЗаказаКлиентовОпта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_СоответствиеДокументовПланПродаж/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ДобавитьЗапись(ДокументСсылка, НомерЕРП, ГУИДЕРП) Экспорт
	
	НЗ = РегистрыСведерний.ксп_СоответствиеДокументовПланПродаж.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокументСсылка.Установить(ДокументСсылка);
	НовСтр = НЗ.Добавить();
	НовСтр.ДокументСсылка = ДокументСсылка;
	НовСтр.НомерДокументаЕРП = НомерЕРП;
	НовСтр.ГУИДЕРП = ГУИДЕРП;
	
	НЗ.Записать();
	
		
КонецФункции
